WS-composicao-fluxo-alternativo/OperationsBpel/src/OperationsBpel.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="OperationsBpel" targetNamespace="http://j2ee.netbeans.org/wsdl/OperationsBpel/src/OperationsBpel"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/OperationsBpel/src/OperationsBpel" xmlns:ns="http://xml.netbeans.org/schema/OperationsBpel" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/OperationsBpel/src/OperationsBpel">
            <xsd:import namespace="http://xml.netbeans.org/schema/OperationsBpel" schemaLocation="OperationsBpel.xsd"/>
        </xsd:schema>
    </types>
    <message name="OperationsBpelOperationRequest">
        <part name="opRequest" element="ns:opElement"/>
    </message>
    <message name="OperationsBpelOperationResponse">
        <part name="opResponse" element="ns:opRespElement"/>
    </message>
    <portType name="OperationsBpelPortType">
        <operation name="OperationsBpelOperation">
            <input name="input1" message="tns:OperationsBpelOperationRequest"/>
            <output name="output1" message="tns:OperationsBpelOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="OperationsBpel">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="OperationsBpelPortTypeRole" portType="tns:OperationsBpelPortType"/>
    </plnk:partnerLinkType>
</definitions>
