WS-composicao-fluxo-alternativo/opCompositeApp/test/AddTestCase/Output.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <opRespElement xmlns="http://xml.netbeans.org/schema/OperationsBpel" xmlns:msgns="http://j2ee.netbeans.org/wsdl/OperationsBpel/src/OperationsBpel">
      <return>5</return>
    </opRespElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>