WS-composicao-fluxo-alternativo/opCompositeApp/test/MultTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oper="http://xml.netbeans.org/schema/OperationsBpel">
  <soapenv:Body>
    <oper:opElement>
        <oper:opName>mult</oper:opName>
        <oper:num1>2</oper:num1>
        <oper:num2>3</oper:num2>
    </oper:opElement>
  </soapenv:Body>
</soapenv:Envelope>